udaybhan200683/Ghar_sajag/code/ParivarSathi_v1.5.4_PWA_BatteryAnalytics_v3_4_2/firmware/node/target/esp32c3/node_runtime_adapter.cpp
#include "firmware/node/target/esp32c3/node_runtime_adapter.hpp"

#include "firmware/common/transport/data_plane_codec.hpp"
#include "firmware/common/security/psa_commissioning_crypto.hpp"
#include "firmware/common/security/target_identity_signer.hpp"
#include "firmware/common/security/target_wrapping_key.hpp"
#include "firmware/node/runtime/node_runtime.hpp"
#include "firmware/node/target/esp32c3/node_security_link.hpp"
#include "firmware/node/target/esp32c3/node_target_config.hpp"
#include "firmware/node/target/esp32c3/nvs_session_provider.hpp"
#include "sensing/sensing.hpp"

#include "driver/gpio.h"
#include "esp_event.h"
#include "esp_idf_version.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_now.h"
#include "esp_random.h"
#include "esp_ota_ops.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "freertos/task.h"
#include "nvs_flash.h"

#include <algorithm>
#include <array>
#include <atomic>
#include <cstddef>
#include <cstdint>
#include <cstring>
#include <cstdio>
#include <optional>
#include <vector>

namespace gs::node::target {
namespace {

constexpr char kTag[] = "gs_node_runtime";
constexpr UBaseType_t kAckQueueDepth = 8U;
constexpr UBaseType_t kControlQueueDepth = 8U;
constexpr UBaseType_t kSecurityQueueDepth = 8U;
constexpr UBaseType_t kSendQueueDepth = 4U;
constexpr Milliseconds kSendCallbackTimeoutMs = 1000;
constexpr Milliseconds kHealthIntervalMs = 60000;

struct SendResult {
    bool accepted_by_radio{false};
};

StaticQueue_t g_ack_queue_state{};
StaticQueue_t g_control_queue_state{};
StaticQueue_t g_security_queue_state{};
StaticQueue_t g_security_send_queue_state{};
StaticQueue_t g_send_queue_state{};
#if !GS_HIL_BUILD
StaticQueue_t g_fota_ack_queue_state{};
alignas(AuthenticatedFotaAck) std::array<std::uint8_t, 4U * sizeof(AuthenticatedFotaAck)> g_fota_ack_storage{};
QueueHandle_t g_fota_ack_queue = nullptr;
#endif
alignas(ReceivedFrame) std::array<std::uint8_t, kAckQueueDepth * sizeof(ReceivedFrame)> g_ack_storage{};
alignas(ReceivedFrame) std::array<std::uint8_t, kControlQueueDepth * sizeof(ReceivedFrame)> g_control_storage{};
alignas(ReceivedFrame) std::array<std::uint8_t, kSecurityQueueDepth * sizeof(ReceivedFrame)> g_security_storage{};
alignas(SendResult) std::array<std::uint8_t, sizeof(SendResult)> g_security_send_storage{};
alignas(SendResult) std::array<std::uint8_t, kSendQueueDepth * sizeof(SendResult)> g_send_storage{};
QueueHandle_t g_ack_queue = nullptr;
QueueHandle_t g_control_queue = nullptr;
QueueHandle_t g_security_queue = nullptr;
QueueHandle_t g_security_send_queue = nullptr;
QueueHandle_t g_send_queue = nullptr;
std::uint64_t g_session_id = 0;
std::atomic<std::uint32_t> g_ack_queue_drops{0};
std::atomic<std::uint32_t> g_control_queue_drops{0};
std::atomic<std::uint32_t> g_send_queue_drops{0};
std::atomic<std::uint32_t> g_fota_timeouts{0};
std::atomic<bool> g_control_plane_active{false};
std::atomic<bool> g_security_phase{true};
std::atomic<bool> g_ota_owner_started{false};
std::atomic<bool> g_ota_sensing_ready{false};
std::atomic<bool> g_ota_post_sensing_radio_confirmed{false};
std::atomic<std::uint32_t> g_ota_post_sensing_runtime_ticks{0};
#if GS_HIL_BUILD
std::atomic<std::uint32_t> g_hil_motion_pending{0};
std::atomic<bool> g_hil_force_health{false};
std::atomic<std::uint32_t> g_hil_retained{0};
std::atomic<std::uint32_t> g_hil_in_flight{0};
std::atomic<std::uint32_t> g_hil_runtime_live{0};
std::atomic<std::uint32_t> g_hil_sensing_live{0};
#endif

Milliseconds monotonic_ms() {
    return static_cast<Milliseconds>(esp_timer_get_time() / 1000);
}

bool from_qualified_hub(const std::uint8_t* mac) {
    return mac != nullptr &&
           std::memcmp(mac, kQualifiedHubMac.data(), kQualifiedHubMac.size()) == 0;
}

void receive_callback(const esp_now_recv_info_t* info, const std::uint8_t* data,
                      int length) {
    if (info == nullptr || data == nullptr ||
        length <= 0 || static_cast<std::size_t>(length) > kTargetEspNowPayloadMax) {
        return;
    }

    const bool security_wire = length >= 3 && data[0] == 0x47 &&
                               data[1] == 0x53 && data[2] == 1;
    const bool secured_runtime = length >= 3 && data[0] == 0x47 &&
                                 data[1] == 0x53 && data[2] == 2;
    const auto frame_class = transport::classify_frame(data, static_cast<std::size_t>(length));
    QueueHandle_t destination = nullptr;
    if (security_wire) {
        destination = g_security_queue;
    } else if (secured_runtime) {
        destination = g_ack_queue;
    }
#if GS_HIL_BUILD
    else if (frame_class == transport::FrameClass::NodeAck &&
               from_qualified_hub(info->src_addr)) {
        destination = g_ack_queue;
    }
    else if (frame_class == transport::FrameClass::ControlFota &&
               from_qualified_hub(info->src_addr)) {
        destination = g_control_queue;
    }
#endif
    else {
        return;
    }
    if (destination == nullptr) return;

    ReceivedFrame envelope;
    std::memcpy(envelope.source_mac.data(), info->src_addr, envelope.source_mac.size());
    envelope.size = static_cast<std::uint16_t>(length);
    if (info->rx_ctrl != nullptr) {
        envelope.transport_rssi = info->rx_ctrl->rssi;
        envelope.channel = info->rx_ctrl->channel;
    }
    std::memcpy(envelope.bytes.data(), data, envelope.size);
    if (xQueueSend(destination, &envelope, 0) != pdTRUE) {
        if (destination == g_ack_queue) {
            g_ack_queue_drops.fetch_add(1U, std::memory_order_relaxed);
        } else {
            g_control_queue_drops.fetch_add(1U, std::memory_order_relaxed);
        }
    }
}

#if ESP_IDF_VERSION_MAJOR >= 6
void send_callback(const esp_now_send_info_t*, esp_now_send_status_t status) {
#else
void send_callback(const std::uint8_t*, esp_now_send_status_t status) {
#endif
    // FOTA ACK sends use the same peer and produce indistinguishable MAC
    // callbacks. They belong to the control-plane worker, not NodeRuntime.
    if (g_security_phase.load(std::memory_order_acquire)) {
        if (g_security_send_queue != nullptr) {
            const SendResult result{status == ESP_NOW_SEND_SUCCESS};
            (void)xQueueOverwrite(g_security_send_queue, &result);
        }
        return;
    }
    if (g_send_queue == nullptr ||
        g_control_plane_active.load(std::memory_order_acquire)) return;
    const SendResult result{status == ESP_NOW_SEND_SUCCESS};
    if (xQueueSend(g_send_queue, &result, 0) != pdTRUE) {
        g_send_queue_drops.fetch_add(1U, std::memory_order_relaxed);
    }
}

esp_err_t initialize_gpio() {
    gpio_config_t led{};
    led.pin_bit_mask = 1ULL << kLedGpio;
    led.mode = GPIO_MODE_OUTPUT;
    led.pull_up_en = GPIO_PULLUP_DISABLE;
    led.pull_down_en = GPIO_PULLDOWN_DISABLE;
    led.intr_type = GPIO_INTR_DISABLE;
    esp_err_t result = gpio_config(&led);
    if (result != ESP_OK) return result;
    result = gpio_set_level(static_cast<gpio_num_t>(kLedGpio), kLedActiveLow ? 1 : 0);
    if (result != ESP_OK) return result;

    gpio_config_t pir{};
    pir.pin_bit_mask = 1ULL << kPirGpio;
    pir.mode = GPIO_MODE_INPUT;
    pir.pull_up_en = GPIO_PULLUP_DISABLE;
    pir.pull_down_en = GPIO_PULLDOWN_ENABLE;
    pir.intr_type = GPIO_INTR_DISABLE;
    return gpio_config(&pir);
}

esp_err_t initialize_wifi() {
    esp_err_t result = esp_netif_init();
    if (result != ESP_OK && result != ESP_ERR_INVALID_STATE) return result;
    result = esp_event_loop_create_default();
    if (result != ESP_OK && result != ESP_ERR_INVALID_STATE) return result;
    const wifi_init_config_t config = WIFI_INIT_CONFIG_DEFAULT();
    if ((result = esp_wifi_init(&config)) != ESP_OK) return result;
    if ((result = esp_wifi_set_storage(WIFI_STORAGE_RAM)) != ESP_OK) return result;
    if ((result = esp_wifi_set_mode(WIFI_MODE_STA)) != ESP_OK) return result;
    if ((result = esp_wifi_start()) != ESP_OK) return result;
    if ((result = esp_wifi_set_ps(WIFI_PS_NONE)) != ESP_OK) return result;
    if ((result = esp_wifi_set_channel(kEspNowChannel, WIFI_SECOND_CHAN_NONE)) != ESP_OK) return result;
    if ((result = esp_wifi_set_max_tx_power(kTxPowerQuarterDbm)) != ESP_OK) return result;

    std::array<std::uint8_t, 6> actual_mac{};
    if ((result = esp_wifi_get_mac(WIFI_IF_STA, actual_mac.data())) != ESP_OK) return result;
    #if GS_HIL_BUILD
    if (actual_mac != kQualifiedNodeMac) {
        ESP_LOGE(kTag, "STA MAC does not match qualified C3");
        return ESP_ERR_INVALID_STATE;
    }
    #endif
    return ESP_OK;
}

esp_err_t initialize_esp_now() {
    esp_err_t result = esp_now_init();
    if (result != ESP_OK) return result;
    if ((result = esp_now_register_recv_cb(receive_callback)) != ESP_OK) return result;
    if ((result = esp_now_register_send_cb(send_callback)) != ESP_OK) return result;

    #if GS_HIL_BUILD
    esp_now_peer_info_t peer{};
    std::memcpy(peer.peer_addr, kQualifiedHubMac.data(), kQualifiedHubMac.size());
    peer.channel = 0;
    peer.ifidx = WIFI_IF_STA;
    peer.encrypt = false;  // Production peer key management remains open.
    if (!esp_now_is_peer_exist(kQualifiedHubMac.data())) {
        result = esp_now_add_peer(&peer);
    }
    #endif
    return result;
}

bool send_security_message(const NodeSecurityLink::Outbound& outbound) {
    security::wire::Message message = outbound.message;
    std::vector<security::wire::Packet> packets;
    std::uint32_t transaction = esp_random();
    if (transaction == 0) transaction = 1;
    if (!security::wire::fragment(message, transaction, packets)) return false;
    if (!esp_now_is_peer_exist(outbound.destination.data())) {
        esp_now_peer_info_t peer{};
        std::memcpy(peer.peer_addr, outbound.destination.data(), outbound.destination.size());
        peer.channel = 0;
        peer.ifidx = WIFI_IF_STA;
        peer.encrypt = false;  // Application AEAD protects runtime after rejoin.
        if (esp_now_add_peer(&peer) != ESP_OK) return false;
    }
    for (const auto& packet : packets) {
        (void)xQueueReset(g_security_send_queue);
        if (esp_now_send(outbound.destination.data(), packet.bytes.data(),
                         packet.size) != ESP_OK) return false;
        SendResult result;
        if (xQueueReceive(g_security_send_queue, &result,
                          pdMS_TO_TICKS(kSendCallbackTimeoutMs)) != pdTRUE ||
            !result.accepted_by_radio) return false;
    }
    return true;
}

void owner_task(void*) {
#if !GS_HIL_BUILD
    NodeSecurityLink security_link;
    std::array<std::uint8_t, 6> physical_mac{};
    if (esp_wifi_get_mac(WIFI_IF_STA, physical_mac.data()) != ESP_OK ||
        !security_link.initialize(physical_mac, g_session_id, monotonic_ms())) {
        ESP_LOGE(kTag, "Node security bootstrap failed closed");
        vTaskDelete(nullptr);
        return;
    }
    auto last_outbound = security_link.initial_message();
    if (last_outbound) (void)send_security_message(*last_outbound);
    Milliseconds next_security_retry_ms = monotonic_ms() + 1500;
    while (!security_link.ready()) {
        if (security_link.faulted()) {
            ESP_LOGE(kTag, "Node security owner faulted; runtime admission disabled");
            vTaskDelete(nullptr);
            return;
        }
        ReceivedFrame frame;
        if (xQueueReceive(g_security_queue, &frame, pdMS_TO_TICKS(100)) == pdTRUE) {
            const auto response = security_link.accept(frame.source_mac,
                frame.bytes.data(), frame.size, monotonic_ms());
            if (response) {
                last_outbound = response;
                (void)send_security_message(*response);
                next_security_retry_ms = monotonic_ms() + 1500;
            }
        }
        if (last_outbound && monotonic_ms() >= next_security_retry_ms) {
            (void)send_security_message(*last_outbound);
            next_security_retry_ms = monotonic_ms() + 3000;
        }
    }
    g_security_phase.store(false, std::memory_order_release);
    NodeRuntime runtime(security_link.binding()->logical_id, g_session_id);
#else
    g_security_phase.store(false, std::memory_order_release);
    NodeRuntime runtime(kNodeId, g_session_id);
#endif
#if !GS_HIL_BUILD
    // Restore retained identities only after the new boot session has been
    // authenticated. A corrupt or unreadable record must not start sensing.
    if (!security_link.restore_recovery(runtime, monotonic_ms())) {
        ESP_LOGE(kTag, "Node recovery restore failed; refusing event admission");
        vTaskDelete(nullptr);
        return;
    }
#endif
    g_ota_owner_started.store(true, std::memory_order_release);
    QualifiedInput pir(EventKind::Motion, std::nullopt, kPirDebounceMs,
                       kPirMinimumRetriggerMs);
    std::optional<EventKey> in_flight;
    bool health_in_flight = false;
    Milliseconds sent_at_ms = 0;
    Milliseconds led_off_at_ms = 0;
    Milliseconds next_health_ms =
#if GS_HIL_BUILD
        1000;
#else
        kHealthIntervalMs;
#endif
    std::uint64_t health_sequence = 1;
    std::uint32_t raw_pir_edges = 0;
    std::uint32_t accepted_pir = 0;
    std::uint32_t rejected_pir = 0;
    std::uint32_t sensing_liveness = 0;
    std::uint32_t runtime_liveness = 0;
    std::uint32_t send_attempts = 0;
    std::uint32_t mac_success_count = 0;
    std::uint32_t mac_failure_count = 0;
    bool previous_raw_pir = false;
    bool raw_initialized = false;
    bool previous_maintenance = false;
    NodeBreadcrumb breadcrumb = NodeBreadcrumb::Boot;
    NodeHealthError last_error = NodeHealthError::None;
    const std::uint32_t reset_reason = static_cast<std::uint32_t>(esp_reset_reason());

    ESP_LOGI(kTag, "NodeRuntime owner started session=%llu channel=%u tx_power_qdbm=%d",
             static_cast<unsigned long long>(g_session_id),
             static_cast<unsigned>(kEspNowChannel),
             kTxPowerQuarterDbm);
    vTaskDelay(pdMS_TO_TICKS(kPirStabilizationMs));
    ESP_LOGI(kTag, "PIR ready on GPIO%d", kPirGpio);
    g_ota_sensing_ready.store(true, std::memory_order_release);
    const esp_partition_t* running = esp_ota_get_running_partition();
    esp_ota_img_states_t ota_state{};
    if (running != nullptr &&
        esp_ota_get_state_partition(running, &ota_state) == ESP_OK &&
        ota_state == ESP_OTA_IMG_PENDING_VERIFY) {
        // A pending image needs fresh post-sensing radio evidence. Ordinary
        // boots keep the configured health interval.
        next_health_ms = monotonic_ms();
    }

