udaybhan200683/Ghar_sajag/code/ParivarSathi_v1.5.4_PWA_BatteryAnalytics_v3_4_2/firmware/node/target/esp32c3/node_runtime_adapter.cpp
        g_ota_post_sensing_runtime_ticks.fetch_add(1U, std::memory_order_relaxed);

        vTaskDelay(pdMS_TO_TICKS(kPirPollMs));
    }
}

}  // namespace

QueueHandle_t control_plane_queue() {
    return g_control_queue;
}

#if !GS_HIL_BUILD
bool submit_authenticated_fota_ack(const AuthenticatedFotaAck& ack) {
    return g_fota_ack_queue != nullptr && ack.authenticated_session != 0 &&
           ack.message.type == gs::fota::secure_wire::Type::Ack &&
           xQueueSend(g_fota_ack_queue, &ack, 0) == pdTRUE;
}
#endif

void set_control_plane_active(bool active) {
    g_control_plane_active.store(active, std::memory_order_release);
}

void report_control_plane_timeout() {
    g_fota_timeouts.fetch_add(1U, std::memory_order_relaxed);
}

fota::BootHealthObservation ota_boot_health_observation() {
    return {g_ota_owner_started.load(std::memory_order_acquire),
            g_ota_sensing_ready.load(std::memory_order_acquire),
            g_ota_post_sensing_radio_confirmed.load(std::memory_order_acquire),
            g_control_plane_active.load(std::memory_order_acquire),
            g_ota_post_sensing_runtime_ticks.load(std::memory_order_acquire),
            esp_get_minimum_free_heap_size()};
}

#if GS_HIL_BUILD
void hil_inject_motion() {
    g_hil_motion_pending.fetch_add(1U, std::memory_order_release);
}

void hil_request_health() {
    g_hil_force_health.store(true, std::memory_order_release);
}

void hil_log_state() {
    const esp_partition_t* running_partition = esp_ota_get_running_partition();
    ESP_LOGI(kTag,
             "HIL_STATE role=c3 session=%llu retained=%u in_flight=%u sensing_live=%u runtime_live=%u pending_inject=%u heap=%u min_heap=%u ota_slot=%s",
             static_cast<unsigned long long>(g_session_id),
             static_cast<unsigned>(g_hil_retained.load(std::memory_order_acquire)),
             static_cast<unsigned>(g_hil_in_flight.load(std::memory_order_acquire)),
             static_cast<unsigned>(g_hil_sensing_live.load(std::memory_order_acquire)),
             static_cast<unsigned>(g_hil_runtime_live.load(std::memory_order_acquire)),
             static_cast<unsigned>(g_hil_motion_pending.load(std::memory_order_acquire)),
             static_cast<unsigned>(esp_get_free_heap_size()),
             static_cast<unsigned>(esp_get_minimum_free_heap_size()),
             running_partition == nullptr ? "unknown" : running_partition->label);
}

void hil_log_test_qr() {
    // Development-only provisioning evidence. A production QR is issued by
    // manufacturing and must never expose the device private signing key.
    static security::TargetIdentitySigner identity("node", 0x7001);
    static bool identity_ready = identity.initialize();
    if (!identity_ready) {
        ESP_LOGE(kTag, "HIL_ERROR command=GET_TEST_QR reason=identity_unavailable");
        return;
    }
    security::PsaCommissioningCrypto crypto(identity);
    security::P256PublicKey public_key{};
    security::Key32 code{};
    std::array<std::uint8_t, 6> mac{};
    if (!crypto.ready() || !identity.public_key("node", public_key) ||
        !security::load_target_installer_code(crypto, code) ||
        esp_wifi_get_mac(WIFI_IF_STA, mac.data()) != ESP_OK) {
        crypto.secure_zero(code.data(), code.size());
        ESP_LOGE(kTag, "HIL_ERROR command=GET_TEST_QR reason=provisioning_unavailable");
        return;
    }
    char key_hex[public_key.size() * 2 + 1]{};
    char code_hex[code.size() * 2 + 1]{};
    constexpr char hex[] = "0123456789abcdef";
    for (std::size_t i = 0; i < public_key.size(); ++i) {
        key_hex[2 * i] = hex[public_key[i] >> 4];
        key_hex[2 * i + 1] = hex[public_key[i] & 0x0f];
    }
    for (std::size_t i = 0; i < code.size(); ++i) {
        code_hex[2 * i] = hex[code[i] >> 4];
        code_hex[2 * i + 1] = hex[code[i] & 0x0f];
    }
    ESP_LOGI(kTag,
             "HIL_TEST_QR profile=TEST_ONLY device_id=c3-%02x%02x%02x%02x%02x%02x public_key=%s",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], key_hex);
    ESP_LOGI(kTag,
             "HIL_TEST_CODE profile=TEST_ONLY device_id=c3-%02x%02x%02x%02x%02x%02x installer_code=%s",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], code_hex);
    crypto.secure_zero(code.data(), code.size());
    std::memset(code_hex, 0, sizeof(code_hex));
    ESP_LOGI(kTag, "HIL_OK command=GET_TEST_QR");
}
#endif

esp_err_t start_runtime_adapter() {
    esp_err_t result = nvs_flash_init();
    if (result != ESP_OK) {
        ESP_LOGE(kTag, "NVS init failed; refusing reusable session identity: %s",
                 esp_err_to_name(result));
        return result;
    }
    const auto session = allocate_nvs_session_id();
    if (!session) {
        ESP_LOGE(kTag, "Could not durably allocate boot session");
        return ESP_FAIL;
    }
    g_session_id = *session;

    g_ack_queue = xQueueCreateStatic(kAckQueueDepth, sizeof(ReceivedFrame),
                                     g_ack_storage.data(), &g_ack_queue_state);
    g_control_queue = xQueueCreateStatic(kControlQueueDepth, sizeof(ReceivedFrame),
                                         g_control_storage.data(), &g_control_queue_state);
    g_security_queue = xQueueCreateStatic(kSecurityQueueDepth, sizeof(ReceivedFrame),
                                          g_security_storage.data(), &g_security_queue_state);
    g_security_send_queue = xQueueCreateStatic(1U, sizeof(SendResult),
        g_security_send_storage.data(), &g_security_send_queue_state);
    g_send_queue = xQueueCreateStatic(kSendQueueDepth, sizeof(SendResult),
        g_send_storage.data(), &g_send_queue_state);
#if !GS_HIL_BUILD
    g_fota_ack_queue = xQueueCreateStatic(4U, sizeof(AuthenticatedFotaAck),
        g_fota_ack_storage.data(), &g_fota_ack_queue_state);
#endif
    if (g_ack_queue == nullptr || g_control_queue == nullptr ||
        g_security_queue == nullptr || g_security_send_queue == nullptr ||
        g_send_queue == nullptr
#if !GS_HIL_BUILD
        || g_fota_ack_queue == nullptr
#endif
        ) {
        return ESP_ERR_NO_MEM;
    }
    if ((result = initialize_gpio()) != ESP_OK) return result;
    if ((result = initialize_wifi()) != ESP_OK) return result;
    if ((result = initialize_esp_now()) != ESP_OK) return result;
    if (xTaskCreate(owner_task, "gs_node_owner", 8192, nullptr, 8, nullptr) != pdPASS) {
        return ESP_ERR_NO_MEM;
    }
    return ESP_OK;
}

}  // namespace gs::node::target
